# ElemReferenceName Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..ElemReferenceName Property
ParameterTypeId Class See Also
---
"Is Reference"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId ElemReferenceName { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property ElemReferenceName As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ ElemReferenceName {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace